<?php
/**
 * Created by PhpStorm.
 * User: ge
 * Date: 15-12-3
 * Time: 下午3:17
 */


return [
    200 => [
        'code'      =>  200,
        'msg'       => 'OK'
    ],
    10000 => [
        'code'      =>  10000,
        'msg'       => '非法请求'
    ],
    10001 => [
        'code'      =>  10001,
        'msg'       => '版本过低，请下载最新版本'
    ],
    10002   =>  [
        'code'      =>  10002,
        'msg'       => '参数错误',
    ],
    10003   =>  [
        'code'      =>  10003,
        'msg'       => '验证码错误',
    ],

];