<?php
/**
 * Created by PhpStorm.
 * User: ge
 * Date: 15-12-3
 * Time: 下午3:17
 */


return [
    200 => [
        'code'      =>  200,
        'msg'       => 'OK'
    ],
    10000 => [
        'code'      =>  10000,
        'msg'       => '非法请求'
    ],
    10001 => [
        'code'      =>  10001,
        'msg'       => '版本过低，请下载最新版本'
    ],
    10002   =>  [
        'code'      =>  10002,
        'msg'       => '参数错误',
    ],
    10003   =>  [
        'code'      =>  10003,
        'msg'       => '验证码错误',
    ],

    20001   =>  [
        'code'      => 20001,
        'msg'       => '手机号已经被注册',
    ],
    20002   =>  [
        'code'      => 20002,
        'msg'       => '注册失败',
    ],
    20003   =>  [
        'code'      => 20003,
        'msg'       => '无效用户',
    ],
    20004   =>  [
        'code'      => 20004,
        'msg'       => '无效性别',
    ],
    20005   =>  [
        'code'      => 20005,
        'msg'       => '请勿绑定相同手机号',
    ],
    20006   =>  [
        'code'      => 20006,
        'msg'       => '请填写昵称',
    ],
    20007   =>  [
        'code'      => 20007,
        'msg'       => '用户信息修改失败',
    ],
    20008   =>  [
        'code'      => 20008,
        'msg'       => '请选择头像',
    ],
    20009   =>  [
        'code'      => 20009,
        'msg'       => '无效手机号',
    ],
    20010   =>  [
        'code'      => 20010,
        'msg'       => '该用户禁止登陆',
    ],
    20011   =>  [
        'code'      => 20011,
        'msg'       => '微信登录失败',
    ],
    20012   =>  [
        'code'      => 20012,
        'msg'       => '公司信息修改失败',
    ],
    20013   =>  [
        'code'      => 20013,
        'msg'       => '关闭失败',
    ],
    20014   =>  [
        'code'      => 20014,
        'msg'       => '无法查看认证信息',
    ],
    20015   =>  [
        'code'      => 20015,
        'msg'       => '提交认证信息失败',
    ],
    20016   =>  [
        'code'      => 20016,
        'msg'       => '取消订阅失败',
    ],
    20017   =>  [
        'code'      => 20017,
        'msg'       => '请勿重复订阅',
    ],
];