<?php
/**
 * Created by PhpStorm.
 * User: ge
 * Date: 15-12-4
 * Time: 下午4:20
 */

return [
    //交易方式
    'deal' => [
        1 => '股权转让',
        2 => '产权转让',
    ],
    //代理类型
    'agency_type' => [
        1 => '总销',
        2 => '分销',
        3 => '营销策划',
        4 => '电商',
        5 => '项目运营',
    ],
    //物业类型
    'wuye_type' => [
        1=>'住宅',
        2=>'写字楼',
        3=>'酒店',
        4=>'商铺',
        5=>'厂房',
        6=>'土地',
        7=>'其它',
    ],
    //发布人角色
    'role' => [
        1=>'产权人',
        2=>'开发商',
        3=>'代理商',
        4=>'分销商',
        5=>'中介公司',
        6=>'其它',
    ],
    //装修情况
    'zhuangxiu' => [
        0=>'不限',
        1=>'精装',
        2=>'简装',
        3=>'毛坯',
    ],
    //资产来源
    'source' => [
        0=>'不限',
        1=>'银行',
        2=>'资管公司',
        3=>'拍卖公司',
        4=>'律师事务所',
        5=>'类金融机构',
        6=>'上市公司',
        7=>'国营企业',
        8=>'个人',
    ],
    //服务时间
    'fuwu_time' => [
        1=>'随时可约',
        2=>'仅限周末',
    ],
    //公司规模
    'scale' => [
        1=>'100人以下',
        2=>'100-300人',
        3=>'300人以上',
    ],
    //主营业务
    'poc' => [
        1=>'物业管理',
        2=>'中介服务',
        3=>'地产建设开发',
        4=>'营销策划',
        5=>'金融服务',
        6=>'设计规划',
        7=>'其他',
    ],
    //土地性质
    'tudi' => [
        1=>'商用',
        2=>'住宅',
        3=>'综合',
    ],
    //行业类型
    'type' => [
        1=>'建筑',
        2=>'互联网',
        3=>'金融',
        4=>'房地产',
        5=>'租赁和商务服务',
        6=>'水利环境和公共设施',
        7=>'其他',
    ],
    'class' => [
        1=>'资产交易',
        2=>'个人服务',
        3=>'公司服务',
        4=>'代理',
        5=>'租赁',
        6=>'招标',
        7=>'其他',
    ],
];